iostat-pgbench-kernel/ubuntu-14.04/3.13.0-24-generic-sched_autogroup_enabled_1/pgbench-ro/report.txt
transaction type: SELECT only
scaling factor: 1000
query mode: simple
number of clients: 16
number of threads: 4
duration: 300 s
number of transactions actually processed: 647297
tps = 2157.248407 (including connections establishing)
tps = 2157.614503 (excluding connections establishing)
statement latencies in milliseconds:
	0.004830	\set naccounts 100000 * :scale
	0.003216	\setrandom aid 1 :naccounts
	7.393796	SELECT abalance FROM pgbench_accounts WHERE aid = :aid;